
public class Ex05 {

    /*
    1. 가위 바위 보 게임을 만들어 보자.

    사용자로부터 가위 바위 보 중에서 하나를 입력 받는다.
    그리고 컴퓨터는 난수 생성을 통해서 가위 바위 보 중에서 하나를 선택하게 한다.
     이 둘을 비교해서 승자와 패자를 가려주는 프로그램을 작성해 보자.
    단 프로그램의 진행은 사용자가 질 때까지 계속되어야 하고,
    마지막에 가서는 게임의 결과(예: 4승 3무)까지 출력해 주도록 하자.

다 하셨으면...
    메서드와 클래스로 바꿔보세요

    2. 피보나치 수열 은 앞을 두 수를 더해서 다음 수를 만들어 나가는 수열이다

    예를 들어 앞의 두 수가 1과 1이라면 그 다음 수는 2가 되고 그 다음 수는 1과 2를 더해서 3이 된다.
    1,1,2,3,5,8,13,21,... 이렇게 진행된다
    피보나치수열의 10 번째 수는 무엇인지 계산하는 프로그램을 완성하시오

    3. 구구단의 일부분을 다음과 같이 출력하시오
    2*1=2       3*1=3       4*1=4
    2*2=4       3*2=6       4*2=8
    2*3=6       3*3=9       4*3=12

    5*1=5       6*1=6       7*1=7
    5*2=10      6*2=12      7*2=14
    5*3=15      6*3=18      7*3=21

    8*1=8       9*1=9
    8*2=16      9*2=18
    8*3=24      9*3=27
     */
}














